
&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если РаботаСRMQ.ПроверитьПодключениеПоНастройкамПодключения(Объект.Ссылка) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Компонента подключена. Соединение успешно.";
			Сообщение.Сообщить();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Соединение не установлено, либо очередь не создана.";
			Сообщение.Сообщить();
		КонецЕсли;	
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо записать элемент справочника";
		Сообщение.Сообщить();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры
