
Процедура ДокументыПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;                                                                                                                     
	КонецЕсли;
	
	ИмяОбъекта = ТРег(Строка(ТипЗнч(Источник)));
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, ":", ".");
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, " ", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОтправки.Объект КАК Объект,
		|	НастройкиОтправки.НастройкаПодключения КАК НастройкаПодключения,
		|	НастройкиОтправки.КлючМаршрутизации КАК КлючМаршрутизации,
		|	НастройкиОтправки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Вт_НастройкиОтправки
		|ИЗ
		|	Справочник.НастройкиОтправки КАК НастройкиОтправки
		|ГДЕ
		|	НЕ НастройкиОтправки.ПометкаУдаления
		|	И НастройкиОтправки.Объект = &ИмяОбъекта
		|	И НастройкиОтправки.Направление = &Отправление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиОтправкиРеквизиты.Реквизит КАК Реквизит,
		|	НастройкиОтправкиРеквизиты.Значение КАК Значение,
		|	НастройкиОтправкиРеквизиты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиОтправки.Реквизиты КАК НастройкиОтправкиРеквизиты
		|ГДЕ
		|	НастройкиОтправкиРеквизиты.Ссылка В
		|			(ВЫБРАТЬ
		|				Вт_НастройкиОтправки.Ссылка КАК Ссылка
		|			ИЗ
		|				Вт_НастройкиОтправки КАК Вт_НастройкиОтправки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_НастройкиОтправки.Объект КАК Объект,
		|	Вт_НастройкиОтправки.НастройкаПодключения КАК НастройкаПодключения,
		|	Вт_НастройкиОтправки.КлючМаршрутизации КАК КлючМаршрутизации,
		|	Вт_НастройкиОтправки.Ссылка КАК Ссылка
		|ИЗ
		|	Вт_НастройкиОтправки КАК Вт_НастройкиОтправки";
	
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("Отправление", Перечисления.отусНаправления.Отправление); 
	
	мРезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если Не мРезультатЗапроса.Количество() = 0 Тогда
		
		Выборка = мРезультатЗапроса[2].Выбрать(); 
		ТЗУсловияОтправки = мРезультатЗапроса[1].Выгрузить();
		
		Пока Выборка.Следующий() Цикл
			
			Отправить = Ложь;
			
			Отбор = Новый Структура("Ссылка", Выборка.Ссылка);
			ТекущиеУсловияОтправки = ТЗУсловияОтправки.найтиСтроки(Отбор);
			
			Если ТекущиеУсловияОтправки.Количество() > 0 Тогда
				Если ПроверитьУсловие(Источник, ТекущиеУсловияОтправки) Тогда
					Отправить = Истина;
				КонецЕсли;	
			Иначе	
				Отправить = Истина;
			КонецЕсли;	
			
			Если Отправить Тогда
				ПараметрыЗаписи = Новый Структура;  
				ПараметрыЗаписи.Вставить("Объект", 					Источник.Ссылка);
				ПараметрыЗаписи.Вставить("НастройкаПодключения", 	Выборка.НастройкаПодключения);
				ПараметрыЗаписи.Вставить("КлючМаршрутизации", 		Выборка.КлючМаршрутизации);
				ПараметрыЗаписи.Вставить("НастройкаОтправки", 		Выборка.Ссылка);
			
				РегистрыСведений.СообщенияКОтправке.ДобавитьЗапись(ПараметрыЗаписи); 
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры  

Функция  ПроверитьУсловие(Источник, ТекущиеУсловияОтправки) 
	
	Для каждого ТекУсловие Из ТекущиеУсловияОтправки Цикл
		
		Если Источник[ТекУсловие.Реквизит] <> ТекУсловие.Значение  Тогда
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции	

Процедура РегистрыСведенийПриЗаписиПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;                                                                                                                     
	КонецЕсли;
	
	ИмяОбъекта = ТРег(Строка(ТипЗнч(Источник)));
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, ":", ".");
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, " ", "");   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОтправки.Объект КАК Объект,
		|	НастройкиОтправки.НастройкаПодключения КАК НастройкаПодключения,
		|	НастройкиОтправки.КлючМаршрутизации КАК КлючМаршрутизации,
		|	НастройкиОтправки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Вт_НастройкиОтправки
		|ИЗ
		|	Справочник.НастройкиОтправки КАК НастройкиОтправки
		|ГДЕ
		|	НЕ НастройкиОтправки.ПометкаУдаления
		|	И НастройкиОтправки.Объект = &ИмяОбъекта
		|	И НастройкиОтправки.Направление = &Отправление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиОтправкиРеквизиты.Реквизит КАК Реквизит,
		|	НастройкиОтправкиРеквизиты.Значение КАК Значение,
		|	НастройкиОтправкиРеквизиты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиОтправки.Реквизиты КАК НастройкиОтправкиРеквизиты
		|ГДЕ
		|	НастройкиОтправкиРеквизиты.Ссылка В
		|			(ВЫБРАТЬ
		|				Вт_НастройкиОтправки.Ссылка КАК Ссылка
		|			ИЗ
		|				Вт_НастройкиОтправки КАК Вт_НастройкиОтправки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_НастройкиОтправки.Объект КАК Объект,
		|	Вт_НастройкиОтправки.НастройкаПодключения КАК НастройкаПодключения,
		|	Вт_НастройкиОтправки.КлючМаршрутизации КАК КлючМаршрутизации,
		|	Вт_НастройкиОтправки.Ссылка КАК Ссылка
		|ИЗ
		|	Вт_НастройкиОтправки КАК Вт_НастройкиОтправки";
	
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта); 
	Запрос.УстановитьПараметр("Отправление", Перечисления.отусНаправления.Отправление);
	
	мРезультатЗапроса = Запрос.ВыполнитьПакет();

	Если Не мРезультатЗапроса.Количество() = 0 Тогда   
		
		Выборка = мРезультатЗапроса[2].Выбрать(); 
		ТЗУсловияОтправки = мРезультатЗапроса[1].Выгрузить();
		
		Пока Выборка.Следующий() Цикл
			
			Отправить = Ложь;
			
			Отбор = Новый Структура("Ссылка", Выборка.Ссылка);
			ТекущиеУсловияОтправки = ТЗУсловияОтправки.найтиСтроки(Отбор);
			
			Если ТекущиеУсловияОтправки.Количество() > 0 Тогда
				Если ПроверитьУсловие(Источник, ТекущиеУсловияОтправки) Тогда
					Отправить = Истина;
				КонецЕсли;	
			Иначе	
				Отправить = Истина;
			КонецЕсли;	
			
			Если Отправить И Источник.Количество()<>0 Тогда
				ПараметрыЗаписи = Новый Структура;  
				ПараметрыЗаписи.Вставить("Объект", 					ИмяОбъекта);
				ПараметрыЗаписи.Вставить("ДанныеРегистра", 			Источник[0]);
				ПараметрыЗаписи.Вставить("НастройкаПодключения", 	Выборка.НастройкаПодключения);
				ПараметрыЗаписи.Вставить("КлючМаршрутизации", 		Выборка.КлючМаршрутизации); 
				ПараметрыЗаписи.Вставить("НастройкаОтправки", 		Выборка.Ссылка); 
			
				РегистрыСведений.СообщенияКОтправке.ДобавитьЗапись(ПараметрыЗаписи); 
			КонецЕсли;
			
		КонецЦикла;


	КонецЕсли;	
	
КонецПроцедуры

