
Функция getCardgetCard(Запрос)
	
	НомерТелефона = Запрос.ПараметрыURL.Получить("НомерТелефона");
	
	Если НомерТелефона = Неопределено Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Не задан параметр номер телефона");
		Ответ.Заголовки.Вставить("Content-type", "application/json");
		Возврат Ответ;
	КонецЕсли;
	
	Карта = Справочники.отусВиртуальныеКарты.НайтиКарту(НомерТелефона);
	
	Если Не ЗначениеЗаполнено(Карта) Тогда
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("Карта не найдена");
		Ответ.Заголовки.Вставить("Content-type", "application/json");

		Возврат Ответ;

	КонецЕсли;
		
	Ответ = Новый HTTPСервисОтвет(200);
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(Запись, Карта);
	Результат = Запись.Закрыть();

	Ответ.УстановитьТелоИзСтроки(Результат);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	Возврат Ответ;
	
КонецФункции

Функция balancebalance(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ДанныеЗапрос = Запрос.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ДанныеЗапрос);
	ДанныеКарты = ПрочитатьJSON(Чтение);
		
	СписаниеБонусов = Документы.ОтусСписаниеБонусов.СоздатьДокумент();
	СписаниеБонусов.Дата = ТекущаяДатаСеанса();
	СписаниеБонусов.УстановитьНовыйНомер();
	СписаниеБонусов.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	СписаниеБонусов.Комментарий = СтрШаблон("Списание бонусов от %1", ТекущаяДатаСеанса());

	Карта = СписаниеБонусов.Карты.Добавить();
	Карта.ВиртуальнаяКарта = ДанныеКарты.Карта;
	Карта.Сумма = ДанныеКарты.Сумма;

	Попытка
		СписаниеБонусов.Записать(РежимЗаписиДокумента.Проведение);	
		Ответ.УстановитьТелоИзСтроки(Истина);
		Ответ.Заголовки.Вставить("Content-type", "application/json");		
	Исключение
		Ответ.УстановитьТелоИзСтроки(Ложь);
		Ответ.Заголовки.Вставить("Content-type", "application/json");
	КонецПопытки;

	Возврат Ответ;
	
КонецФункции
