
&НаСервере
Процедура СохранитьНаСервере()
			
	Если Не ЗначениеЗаполнено(Справочники.отусВиртуальныеКарты.НайтиКарту(Телефон).Карта) Тогда  
		Попытка
			НачатьТранзакцию();
			Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
			Контрагент.Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Физ лица"); 
			Контрагент.Фамилия = Фамилия;
			Контрагент.Имя = Имя; 
			Контрагент.Наименование = СтрШаблон("%1 %2", Фамилия, Имя);
			Контрагент.ВидЦен = Справочники.ВидыЦен.НайтиПоНаименованию("Розничная");
			Контрагент.Телефон = Телефон;
			
			Контрагент.Записать();
			
			НоваяКарта = Справочники.отусВиртуальныеКарты.СоздатьЭлемент();
			НоваяКарта.Контрагент = Контрагент.Ссылка;
			НоваяКарта.НомерКарты = Новый УникальныйИдентификатор;
			НоваяКарта.Наименование = СтрШаблон("%1 (%2)", Контрагент.Наименование, НоваяКарта.НомерКарты); 
			НоваяКарта.ПодарочныйСертификат = ПодарочныйСертификат;
			НоваяКарта.Сумма = Сумма;
			НоваяКарта.Записать();
			
			ЗафиксироватьТранзакцию(); 
			Сообщить("Карта создана");
		Исключение
			ОтменитьТранзакцию(); 
			Сообщить("ошибка создания карты");
		КонецПопытки;
	Иначе
		Сообщить(СтрШаблон("На телефон %1 уже зарегистрирована виртуальная карта", Телефон));
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	
	ДанныеЗакрытия = Новый Структура;
	ДанныеЗакрытия.Вставить("ПодарочныйСертификат");
	ДанныеЗакрытия.Вставить("Сумма");
	ЗаполнитьЗначенияСвойств(ДанныеЗакрытия, ЭтотОбъект);

	Закрыть(ДанныеЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодарочныйСертификатПриИзменении(Элемент)
	
	Если ПодарочныйСертификат Тогда
		Элементы.Сумма.Видимость = Истина;
	КонецЕсли;	
		
	
КонецПроцедуры
