 
Процедура СписатьПросроченныеБонусы() Экспорт

	ДнейЖизни = Константы.отусКоличествоДнейЖизниБонусов.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	отусБалансВиртуальныхКарт.Период КАК Период,
		|	отусБалансВиртуальныхКарт.Регистратор КАК Регистратор,
		|	отусБалансВиртуальныхКарт.Карта КАК Карта,
		|	отусБалансВиртуальныхКарт.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.отусБалансВиртуальныхКарт КАК отусБалансВиртуальныхКарт
		|ГДЕ
		|	ДОБАВИТЬКДАТЕ(отусБалансВиртуальныхКарт.Период, ДЕНЬ, &ДнейЖизни) < &Дата";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДнейЖизни", ДнейЖизни);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда 
				
		Выборка = РезультатЗапроса.Выбрать();
		
		мКарты = Новый Массив;

		Пока Выборка.Следующий() Цикл
		
			ДанныеКарты = Новый Структура;
			ДанныеКарты.Вставить("Карта", Выборка.Карта);
			ДанныеКарты.Вставить("Сумма", Выборка.Сумма);
			
			мКарты.Добавить(ДанныеКарты);
		
		КонецЦикла; 
		
		Документы.ОтусСписаниеБонусов.СоздатьДокументСписания(мКарты);
		
	КонецЕсли;	
	
	
КонецПроцедуры	 