 
#Область ПрограммныйИнтерфейс

Процедура СписатьПросроченныеБонусы() Экспорт

	ДнейЖизни = Константы.отусКоличествоДнейЖизниБонусов.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	отусБалансВиртуальныхКарт.Период КАК Период,
		|	отусБалансВиртуальныхКарт.Регистратор КАК Регистратор,
		|	отусБалансВиртуальныхКарт.Карта КАК Карта,
		|	отусБалансВиртуальныхКарт.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.отусБалансВиртуальныхКарт КАК отусБалансВиртуальныхКарт
		|ГДЕ
		|	ДОБАВИТЬКДАТЕ(отусБалансВиртуальныхКарт.Период, ДЕНЬ, &ДнейЖизни) < &Дата";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДнейЖизни", ДнейЖизни);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда 
				
		Выборка = РезультатЗапроса.Выбрать();
		
		мКарты = Новый Массив;

		Пока Выборка.Следующий() Цикл
		
			ДанныеКарты = Новый Структура;
			ДанныеКарты.Вставить("Карта", Выборка.Карта);
			ДанныеКарты.Вставить("Сумма", Выборка.Сумма);
			
			мКарты.Добавить(ДанныеКарты);
		
		КонецЦикла; 
		
		Документы.ОтусСписаниеБонусов.СоздатьДокументСписания(мКарты);
		
	КонецЕсли;	
	
	
КонецПроцедуры	 

Функция НайтиКартуHTTPСервис(НомерТелефона) Экспорт
	
	СерверИсточник = Константы.отусАдресСервераБэкОфис.Получить();
	АдресРесурса = СтрШаблон("/back/hs/cards/getCard/%1", НомерТелефона);
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение(СерверИсточник, 80, "Администратор", "");
	Исключение

		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось соединиться с сервером: " + СерверИсточник;
		Сообщение.Сообщить();
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();

		Возврат Неопределено;

	КонецПопытки; 


	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	
	Попытка
		Результат = HTTPСоединение.Получить(HTTPЗапрос);
		
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());		
		Карта = СериализаторXDTO.ПрочитатьJSON(Чтение);;
		
		Возврат Карта;

	Исключение
	
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Неопределено;
		
	КонецПопытки; 
	
КонецФункции

Функция СписатьБонусыHTTPСервис(Мкарты) Экспорт
	
	СерверИсточник = Константы.отусАдресСервераБэкОфис.Получить();
	АдресРесурса = "/back/hs/cards/balance/111";
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение(СерверИсточник, 80, "Администратор", "");
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось соединиться с сервером: " + СерверИсточник;
		Сообщение.Сообщить();
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();

		Возврат Неопределено;
	КонецПопытки; 
	
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	Запись.УстановитьСтроку(ПараметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(Запись, Мкарты, НазначениеТипаXML.Явное);
	Результат = Запись.Закрыть();
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.УстановитьТелоИзСтроки(Результат);
	
	Попытка
		Результат = HTTPСоединение.Получить(HTTPЗапрос);
		Результат = Результат.ПолучитьТелоКакСтроку();
		
		Если Результат = "Истина" Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	

	Исключение
	
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецПопытки; 
	
КонецФункции	

#КонецОбласти

	