
Функция СоздатьДокументСписания(Мкарты) Экспорт
	
	СписаниеБонусов = Документы.ОтусСписаниеБонусов.СоздатьДокумент(); 
	СписаниеБонусов.Дата = ТекущаяДатаСеанса();
	СписаниеБонусов.УстановитьНовыйНомер();
	СписаниеБонусов.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	СписаниеБонусов.Комментарий = СтрШаблон("Списание бонусов от %1", ТекущаяДатаСеанса());
	
	Для каждого ДанныеКарты Из Мкарты Цикл
		
		Карта = СписаниеБонусов.Карты.Добавить();
		Карта.ВиртуальнаяКарта = ДанныеКарты.Карта;
		Карта.Сумма = ДанныеКарты.Сумма;
		
	КонецЦикла;
	
	Попытка
		СписаниеБонусов.Записать(РежимЗаписиДокумента.Проведение); 
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;	
	
КонецФункции	