
Процедура ДобавитьЗапись(Параметры) Экспорт
	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, Параметры);
	МЗ.Состояние = Перечисления.СостояниеОтправикВRMQ.НеОтправлено;
	
	Если Не Параметры.Свойство("ДанныеРегистра") Тогда
		ТекстСообщения = РаботаСRMQ.СформироватьJSONОбъекта(Параметры.Объект); 
	Иначе
		ТекстСообщения = РаботаСRMQ.СформироватьJSONРегистра(Параметры);
		Если СтрНайти(МЗ.Объект, "ЦеныТоваров") <> 0 Тогда
			МЗ.Объект = СтрШаблон("%1 - %2 - %3", МЗ.Объект, Параметры.ДанныеРегистра.Товар, Параметры.ДанныеРегистра.ВидЦен); 
		КонецЕсли;	
	КонецЕсли;	
	
	МЗ.ТекстСообщения = Новый ХранилищеЗначения(ТекстСообщения, Новый СжатиеДанных(9));
	
	МЗ.Записать();
		
КонецПроцедуры	

Процедура ОтметитьОтправку(Данные, Состояние) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Данные.Объект);
	НаборЗаписей.Отбор.НастройкаПодключения.Установить(Данные.НастройкаПодключения);
	НаборЗаписей.Отбор.КлючМаршрутизации.Установить(Данные.КлючМаршрутизации); 
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		НаборЗаписей[0].Состояние = Состояние;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();

	
КонецПроцедуры	

	